
% =========================================================================
%
%                  长波滤波器的特性
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：
%   作者：c.z.y
%--------------------------------------------------------------------------
%  功能： 1.流程：
%               step1 分析GJ-4型轨检车（三窗级联）函数幅频特性
%               step2 矩形窗 三窗级联 最优化设计函数幅频特性
%               step3 三窗级联 最优化设计 对比 原GJ-4型窗函数幅频特性
%               step4 确认窗函数选择
%        2.备注：
%               - 对于及联矩形窗滤波器的方法讨论
%        3. 
%--------------------------------------------------------------------------
clear all
close all
%step1 分析GJ-4型轨检车（三窗级联）函数幅频特性
%step2 矩形窗 三窗级联 最优化设计函数幅频特性
%step3 三窗级联 最优化设计 对比 原GJ-4型窗函数幅频特性
%step4 确认窗函数选择
lamda = 1:0.001:1000;    %空间波长
pesi  = 1 ./ lamda;      %空间频率

%% 两个矩形窗的表示方法
%% 矩形窗1
L = 38;
N = 2*L + 1;
V_z_1  = ( (exp(-1j.*pesi)).^L - (exp(-1j.*pesi)).^(-L-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / N ;
%%矩形窗2
L = 58;
N = 2*L + 1;
V_z_2  = ( (exp(-1j.*pesi)).^L - (exp(-1j.*pesi)).^(-L-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / N ;

V_z_3 = V_z_1.*V_z_2;

figure;semilogx( 1./pesi, 20*log10(V_z_3) );

%% 三阶不等长矩形窗级联  55 69 83   
L_base = 97;

L1   = ( L_base*0.6505 - 1 )/2 ;
% L1   = 28;
R_54 = ( (exp(-1j.*pesi)).^L1 - (exp(-1j.*pesi)).^(-L1-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / (2*L1) ;

L2   = ( L_base*0.8313 - 1 )/2 ;
% L2   = 40;
R_69 = ( (exp(-1j.*pesi)).^L2 - (exp(-1j.*pesi)).^(-L2-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / (2*L2);

L3   = ( L_base- 1 ) /2 ;
% L3   = 48;
R_83 = ( (exp(-1j.*pesi)).^L3 - (exp(-1j.*pesi)).^(-L3-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / (2*L3);
R_z_3 = R_54 .* R_69 .*R_83 ;

figure
semilogx( pesi, 20*log10(V_z_3) ,'r', pesi, 20*log10(R_z_3),'g');
legend  ('二窗级联','三窗级联最优化');

figure
semilogx( lamda, 20*log10(V_z_3) ,'r', lamda, 20*log10(R_z_3),'g');
legend  ('二窗级联','三窗级联最优化');

%%
L4   = ( L_base*1.45- 1 ) /2 ;
% L3   = 48;
R_tp = ( (exp(-1j.*pesi)).^L4 - (exp(-1j.*pesi)).^(-L4-1) ) ...
    ./ (  1 - exp(-1j.*pesi) ) / (2*L4);
R_z_4 = R_54 .* R_69 .*R_83 .* R_tp;

figure
semilogx( pesi, 20*log10(V_z_3) ,'r', pesi, 20*log10(R_z_3),'g', pesi, 20*log10(R_z_4),'b');
legend  ('二窗级联','三窗级联最优化','修改之后');





