
% =========================================================================
%
%                  测试IMU的噪声模型
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 9月16日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.
%        2.
%       3. 
%--------------------------------------------------------------------------


clear all;
close all;



%% bias 
% v = 10/3.6;
% dt = 0.25/v; %%任意都行
% BS = 0.01;    %%o/√h-->6对应√(3600/100)
% sigma = BS*sqrt(dt)/sqrt(100);%%400s%%这是随机游走的白噪声
% %%加噪怎么加？这个需要考虑一下
% for j = 1:10000
%     ARW = 0;
%     for i = 0:dt:100
%         ARW = ARW + randn*sigma;
%     end
%     ARW_save(j) = ARW;
% end
% std(ARW_save)*sqrt(dt) - sigma*sqrt(100)


%%
v = 1/3.6;
dt = 0.25/v; %%任意都行
BS = 0.01;    %%o/√h-->6对应√(3600/100)
sigma = BS*sqrt(dt);%%400s%%这是随机游走的白噪声
%%加噪怎么加？这个需要考虑一下
t_end = 1000;
for j = 1:10000
    ARW = 0;
    for i = 0:dt:t_end
        ARW = ARW + randn*sigma;
    end
    ARW_save(j) = ARW;
end
std(ARW_save)
BS*sqrt(t_end)
