% =========================================================================
%
%                  测试微分与反向差分法的差
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 9月16日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.
%        2.
%       3. 
%--------------------------------------------------------------------------
clear all;
close all;
f = 0.1:0.001:1e3;
Omega = 2*pi*f;

v = 200/3.6;%%这里在空间域与速度没有关系，因为采样率也在变
fs = v/0.25;
psi = f./v;
%% 模拟
Cs = (1j*Omega).^2;
figure1 = figure('Color',[1 1 1]);
semilogx( 1./psi , 20*log10(abs(Cs)),'LineWidth',1 );
xlabel('模拟频率 (Hz)');
ylabel('dB');

z_1 = exp(-j*2*pi*f/fs);
Rz = (1-2*z_1+z_1.^2)/(1/fs)^2;
hold on;semilogx(1./psi,20*log10(abs(Rz)),'r','LineWidth',1);
xlabel('\lambda m');ylabel('Mag dB');
set(gca,'Fontname','Times New Roman','fontsize',14);grid on;

%%


Omega_1 = (10^5)/(2^17);%%截止频率
% Omega_1 = 0.9;%%截止频率
omiga =  2*pi.*f;           % 模拟角频率 rad/sec
Bs = Omega_1 ./ (1j.*(omiga) + Omega_1);

