% =========================================================================
%
%                  测试误差
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 11月3日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.0.25米直线向前采样，实际上并不是。实际上0.25并不是对应的是里程，对应的是
%               曲线积分的长度，这里有一个误差项，导致里程累加越来越不准。
%        2.
%       3. 
%--------------------------------------------------------------------------

clear all;
close all;


dt = 0.0001;
x = 1000;
t = 0:dt:x;
result = 0;
count = 1;
for tt = t
    result = result + sqrt(1+cos(tt)^2)*dt;
    result_save(count) = result;
    count = count+ 1;
end

figure;plot(t,result_save);
hold on;
plot(t,sqrt(1+0.5)*t)
legend 积分曲线 逼近曲线

figure;plot(t,sqrt(1+0.5)*t-result_save);
