
% =========================================================================
%
%                   长波滤波器原理探究
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 9月23日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.旧版本的长波滤波器的（70m波长）副频曲线对比
%        2.不同滤波器对比，首先运行new_report_2tri_2rec_final.m
%        3. 
%--------------------------------------------------------------------------


clear all;
close all;
% 横坐标配置
N=128^2;
w=linspace(0,pi,N);
lamda = 2*pi./w./4;%%这样表示波长很奇怪

%%  参数配置
%三角窗+矩形窗并联幅频特性分析
N=128^2;
Tri1 = zeros(1, N);
Tri2 = zeros(1,N);
Rec1 = zeros(1,N);
Rec2 = zeros(1,N);  

%% 调整窗长
%% 文档
N1 = 160*2+1;
N2 = 40*2+1;
N3 = 160;
N4 = 281;
%% 旧的
% N1 = 313;%%三角
% N2 = 85;%%三角
% N3 = 313;%%矩形
% N4 = 545;%%矩形

%% 代码
N1 = 281;
N2 = 71;
N3 = 281;
N4 = 491;
%% 计算半窗长
M1 = (N1-1)/2;%%三角窗的半窗长
M2 = (N2-1)/2;%%三角窗的半窗长


%%
for i=1:N
    % 三角窗
    Tri1(i)= ((sin(w(i)*M1/2)/sin(w(i)/2))/M1)*((sin(w(i)*M1/2)/sin(w(i)/2))/M1);
    Tri2(i)= ((sin(w(i)*M2/2)/sin(w(i)/2))/M2)*((sin(w(i)*M2/2)/sin(w(i)/2))/M2);
    % 矩形窗
    Rec1(i)= ((sin(w(i)*N3/2)/sin(w(i)/2))/N3);
    Rec2(i)= ((sin(w(i)*N4/2)/sin(w(i)/2))/N4);
end
% 并联的系数
MulFilter = 1.036*Tri1-0.036*Tri2+0.25*(Rec1-Rec2);
ensco1 = 1 - MulFilter;         %%这个为什么是这样的
Acc_TriRec_70 = ensco1;

%%

fig = figure;
semilogx((lamda), ((Acc_TriRec_70)), 'b','LineWidth',2);
plot_line_func(Acc_TriRec_70,lamda,70);
xlabel('Wavelength /m')
ylabel('Magnitude /dB')
set(gca,'Fontname','Times New Roman','fontsize',14);

