

% =========================================================================
%
%                  测试
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 9月16日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.差分的计算与结果对比
%        2.
%        3. 
%  进一步想法：
%           1.可以通过仿真的方法，对比分析误差量
%           2.怎么样去仿真呢？这是一个问题，是不是可以进行模态分析？
% 
% 
%--------------------------------------------------------------------------


d = textread('gplpe.txt');
for i = 1:length(d)
    if i == 1
       x_dot = 0;
       x_dot_2 = 0;
       p_x_dot = 0;
    else
        x_dot = d(i) - d(i-1);
        x_dot_2 = x_dot - p_x_dot;
        p_x_dot = x_dot;
        
        x_dot_2_s(i) = x_dot_2;
    end
end

x_dot = 0;
p_x_dot = 0;
x = 0;
p_x = 0;
for i = 4:length(d)
    
    x_dot_2 = x_dot_2_s(i);
    x_dot = x_dot + x_dot_2;
    x = x + x_dot;

    
    x_s(i) = x;
    
end

figure;
plot([zeros(1,0), x_s]);
hold on;
plot(d)

