
% =========================================================================
%
%                  psd测试
%
% =========================================================================
%
%　(C)2019-2022 铁道科学研究院-基础所
%   版本：V1.0
%   日期：2020年 9月27日
%   作者：s.m.
%--------------------------------------------------------------------------
%  功能： 1.
%        2.
%       3. 
%--------------------------------------------------------------------------



%% psd
t = 0:0.001:0.6;
a = length(t);
x = sin(2*pi*60*t)+sin(2*pi*150*t)+2*randn(size(t));
plot(1000*t(1:400),x(1:400))
title('signal of randn noise')
xlabel('time(ms)')
ylabel('rad')
grid on;

y=fft(x,a);
psd = y.*conj(y)/a;%双边功率谱密度
f=1000*(1:a)/a;
figure;
plot(f,psd(1:a))
title('psd of the signal')
xlabel('frequency(HZ)')
ylabel('rad^2/hz')
grid on;


%%

h = abs(fftshift(fft(x)));
h = h(length(h)/2+1:end);
N = length(x);
f = (1:N/2)/N*1000;
figure;plot(f,h.^2);

